---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.Origin
zh: 原点
source: html/73b449f5-d5b2-bf98-da72-867aa3e69894.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.Origin Property

**中文**: 原点

The origin position of the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```